[Survived] BlockStatement
src/controllers/authController.js:12:39
         /**
          * @description Controller untuk menangani registrasi pengguna.
          */
-        register: async (req, res) => {
-            try {
-                const { email, password, name, phoneNumber, address } = req.body;
-
-                if (!email || !password || !name) {
-                    return res.status(400).json({ message: 'Email, password, dan nama wajib diisi.' });
-                }
-
-                const additionalData = { name, phoneNumber, address };
-                const result = await authService.registerUser(email, password, additionalData);
-
-                return res.status(201).json({
-                    message: 'Registrasi berhasil. Silakan cek email Anda untuk verifikasi.',
-                    data: result,
-                });
-            } catch (error) {
-                console.error("Error di controller register:", error);
-
-                if (error.message.includes("Email sudah terdaftar")) {
-                    return res.status(409).json({ message: error.message });
-                }
-
-                return res.status(400).json({ message: error.message || "Registrasi gagal." });
-            }
-        },
+        register: async (req, res) => {},
 
         /**

[Survived] BlockStatement
src/controllers/authController.js:13:17
          * @description Controller untuk menangani registrasi pengguna.
          */
         register: async (req, res) => {
-            try {
-                const { email, password, name, phoneNumber, address } = req.body;
-
-                if (!email || !password || !name) {
-                    return res.status(400).json({ message: 'Email, password, dan nama wajib diisi.' });
-                }
-
-                const additionalData = { name, phoneNumber, address };
-                const result = await authService.registerUser(email, password, additionalData);
-
-                return res.status(201).json({
-                    message: 'Registrasi berhasil. Silakan cek email Anda untuk verifikasi.',
-                    data: result,
-                });
-            } catch (error) {
+            try {} catch (error) {
                 console.error("Error di controller register:", error);
 

[Survived] BooleanLiteral
src/controllers/authController.js:16:44
             try {
                 const { email, password, name, phoneNumber, address } = req.body;
 
-                if (!email || !password || !name) {
+                if (!email || !password || name) {
                     return res.status(400).json({ message: 'Email, password, dan nama wajib diisi.' });
                 }

[Survived] BooleanLiteral
src/controllers/authController.js:16:21
             try {
                 const { email, password, name, phoneNumber, address } = req.body;
 
-                if (!email || !password || !name) {
+                if (email || !password || !name) {
                     return res.status(400).json({ message: 'Email, password, dan nama wajib diisi.' });
                 }

[Survived] ObjectLiteral
src/controllers/authController.js:17:49
                 const { email, password, name, phoneNumber, address } = req.body;
 
                 if (!email || !password || !name) {
-                    return res.status(400).json({ message: 'Email, password, dan nama wajib diisi.' });
+                    return res.status(400).json({});
                 }
 

[Survived] ObjectLiteral
src/controllers/authController.js:23:45
                 const additionalData = { name, phoneNumber, address };
                 const result = await authService.registerUser(email, password, additionalData);
 
-                return res.status(201).json({
-                    message: 'Registrasi berhasil. Silakan cek email Anda untuk verifikasi.',
-                    data: result,
-                });
+                return res.status(201).json({});
             } catch (error) {
                 console.error("Error di controller register:", error);

[Survived] BlockStatement
src/controllers/authController.js:27:29
                     message: 'Registrasi berhasil. Silakan cek email Anda untuk verifikasi.',
                     data: result,
                 });
-            } catch (error) {
-                console.error("Error di controller register:", error);
-
-                if (error.message.includes("Email sudah terdaftar")) {
-                    return res.status(409).json({ message: error.message });
-                }
-
-                return res.status(400).json({ message: error.message || "Registrasi gagal." });
-            }
+            } catch (error) {}
         },
 

[Survived] BlockStatement
src/controllers/authController.js:30:70
             } catch (error) {
                 console.error("Error di controller register:", error);
 
-                if (error.message.includes("Email sudah terdaftar")) {
-                    return res.status(409).json({ message: error.message });
-                }
+                if (error.message.includes("Email sudah terdaftar")) {}
 
                 return res.status(400).json({ message: error.message || "Registrasi gagal." });

[Survived] ConditionalExpression
src/controllers/authController.js:30:21
             } catch (error) {
                 console.error("Error di controller register:", error);
 
-                if (error.message.includes("Email sudah terdaftar")) {
+                if (false) {
                     return res.status(409).json({ message: error.message });
                 }

[Survived] ConditionalExpression
src/controllers/authController.js:34:56
                     return res.status(409).json({ message: error.message });
                 }
 
-                return res.status(400).json({ message: error.message || "Registrasi gagal." });
+                return res.status(400).json({ message: true });
             }
         },

[Survived] ConditionalExpression
src/controllers/authController.js:34:56
                     return res.status(409).json({ message: error.message });
                 }
 
-                return res.status(400).json({ message: error.message || "Registrasi gagal." });
+                return res.status(400).json({ message: false });
             }
         },

[Survived] BlockStatement
src/controllers/authController.js:41:36
         /**
          * @description Controller untuk menangani login pengguna.
          */
-        login: async (req, res) => {
-            try {
-                const { email, password } = req.body;
-
-                if (!email || !password) {
-                    return res.status(400).json({ message: 'Email dan password wajib diisi.' });
-                }
-
-                const result = await authService.loginUser(email, password);
-
-                res.status(200).json({
-                    message: 'Login berhasil',
-                    session: result.session,
-                    user: result.user,
-                });
-            } catch (error) {
-                res.status(401).json({ message: error.message });
-            }
-        },
+        login: async (req, res) => {},
 
         /**

[Survived] BlockStatement
src/controllers/authController.js:42:17
          * @description Controller untuk menangani login pengguna.
          */
         login: async (req, res) => {
-            try {
-                const { email, password } = req.body;
-
-                if (!email || !password) {
-                    return res.status(400).json({ message: 'Email dan password wajib diisi.' });
-                }
-
-                const result = await authService.loginUser(email, password);
-
-                res.status(200).json({
-                    message: 'Login berhasil',
-                    session: result.session,
-                    user: result.user,
-                });
-            } catch (error) {
+            try {} catch (error) {
                 res.status(401).json({ message: error.message });
             }

[Survived] BooleanLiteral
src/controllers/authController.js:45:21
             try {
                 const { email, password } = req.body;
 
-                if (!email || !password) {
+                if (email || !password) {
                     return res.status(400).json({ message: 'Email dan password wajib diisi.' });
                 }

[Survived] ConditionalExpression
src/controllers/authController.js:45:21
             try {
                 const { email, password } = req.body;
 
-                if (!email || !password) {
+                if (false) {
                     return res.status(400).json({ message: 'Email dan password wajib diisi.' });
                 }

[Survived] StringLiteral
src/controllers/authController.js:52:30
                 const result = await authService.loginUser(email, password);
 
                 res.status(200).json({
-                    message: 'Login berhasil',
+                    message: "",
                     session: result.session,
                     user: result.user,

[Survived] BlockStatement
src/controllers/authController.js:56:29
                     session: result.session,
                     user: result.user,
                 });
-            } catch (error) {
-                res.status(401).json({ message: error.message });
-            }
+            } catch (error) {}
         },
 

[Survived] ObjectLiteral
src/controllers/authController.js:57:38
                     user: result.user,
                 });
             } catch (error) {
-                res.status(401).json({ message: error.message });
+                res.status(401).json({});
             }
         },

[Survived] BlockStatement
src/controllers/authController.js:64:37
         /**
          * @description Controller untuk menangani logout pengguna.
          */
-        logout: async (req, res) => {
-            try {
-                const token = req.headers.authorization.split(' ')[1];
-                await authService.logoutUser(token);
-                res.status(200).json({ message: 'Anda telah berhasil Logout.' });
-            } catch (error) {
-                res.status(401).json({ message: 'Token tidak valid.' });
-            }
-        },
+        logout: async (req, res) => {},
 
         /**

[Survived] BlockStatement
src/controllers/authController.js:65:17
          * @description Controller untuk menangani logout pengguna.
          */
         logout: async (req, res) => {
-            try {
-                const token = req.headers.authorization.split(' ')[1];
-                await authService.logoutUser(token);
-                res.status(200).json({ message: 'Anda telah berhasil Logout.' });
-            } catch (error) {
+            try {} catch (error) {
                 res.status(401).json({ message: 'Token tidak valid.' });
             }

[Survived] ObjectLiteral
src/controllers/authController.js:68:38
             try {
                 const token = req.headers.authorization.split(' ')[1];
                 await authService.logoutUser(token);
-                res.status(200).json({ message: 'Anda telah berhasil Logout.' });
+                res.status(200).json({});
             } catch (error) {
                 res.status(401).json({ message: 'Token tidak valid.' });

[Survived] BlockStatement
src/controllers/authController.js:69:29
                 const token = req.headers.authorization.split(' ')[1];
                 await authService.logoutUser(token);
                 res.status(200).json({ message: 'Anda telah berhasil Logout.' });
-            } catch (error) {
-                res.status(401).json({ message: 'Token tidak valid.' });
-            }
+            } catch (error) {}
         },
 

[Survived] ObjectLiteral
src/controllers/authController.js:70:38
                 await authService.logoutUser(token);
                 res.status(200).json({ message: 'Anda telah berhasil Logout.' });
             } catch (error) {
-                res.status(401).json({ message: 'Token tidak valid.' });
+                res.status(401).json({});
             }
         },

[Survived] BlockStatement
src/controllers/authController.js:77:45
         /**
          * @description Controller untuk menangani permintaan reset password.
          */
-        forgotPassword: async (req, res) => {
-            const { email } = req.body;
-
-            if (!email) {
-                return res.status(400).json({ message: 'Email wajib diisi.' });
-            }
-
-            try {
-                const { error } = await authService.forgotPassword(email);
-
-                if (error) {
-                    console.error(error);
-                    return res.status(400).json({ message: error.message });
-                }
-
-                return res.status(200).json({
-                    message: 'Jika email terdaftar, link untuk reset password sudah dikirimkan.',
-                });
-            } catch (error) {
-                console.error(error);
-                return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });
-            }
-        },
+        forgotPassword: async (req, res) => {},
 
         /**

[Survived] StringLiteral
src/controllers/authController.js:81:56
             const { email } = req.body;
 
             if (!email) {
-                return res.status(400).json({ message: 'Email wajib diisi.' });
+                return res.status(400).json({ message: "" });
             }
 

[Survived] BlockStatement
src/controllers/authController.js:84:17
                 return res.status(400).json({ message: 'Email wajib diisi.' });
             }
 
-            try {
-                const { error } = await authService.forgotPassword(email);
-
-                if (error) {
-                    console.error(error);
-                    return res.status(400).json({ message: error.message });
-                }
-
-                return res.status(200).json({
-                    message: 'Jika email terdaftar, link untuk reset password sudah dikirimkan.',
-                });
-            } catch (error) {
+            try {} catch (error) {
                 console.error(error);
                 return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });

[Survived] ObjectLiteral
src/controllers/authController.js:89:49
 
                 if (error) {
                     console.error(error);
-                    return res.status(400).json({ message: error.message });
+                    return res.status(400).json({});
                 }
 

[Survived] ObjectLiteral
src/controllers/authController.js:92:45
                     return res.status(400).json({ message: error.message });
                 }
 
-                return res.status(200).json({
-                    message: 'Jika email terdaftar, link untuk reset password sudah dikirimkan.',
-                });
+                return res.status(200).json({});
             } catch (error) {
                 console.error(error);

[Survived] StringLiteral
src/controllers/authController.js:93:30
                 }
 
                 return res.status(200).json({
-                    message: 'Jika email terdaftar, link untuk reset password sudah dikirimkan.',
+                    message: "",
                 });
             } catch (error) {

[Survived] BlockStatement
src/controllers/authController.js:95:29
                 return res.status(200).json({
                     message: 'Jika email terdaftar, link untuk reset password sudah dikirimkan.',
                 });
-            } catch (error) {
-                console.error(error);
-                return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });
-            }
+            } catch (error) {}
         },
 

[Survived] StringLiteral
src/controllers/authController.js:97:56
                 });
             } catch (error) {
                 console.error(error);
-                return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });
+                return res.status(500).json({ message: "" });
             }
         },

[Survived] BlockStatement
src/controllers/authController.js:104:44
         /**
          * @description Controller untuk menangani proses reset password.
          */
-        resetPassword: async (req, res) => {
-            const { newPassword } = req.body;
-            const { token } = req.query;
-
-            if (!token || !newPassword) {
-                return res.status(400).json({ message: 'Token dan password baru wajib diisi.' });
-            }
-
-            try {
-                const { error } = await authService.resetPassword(token, newPassword);
-
-                if (error) {
-                    console.error(error);
-                    return res.status(400).json({ message: error.message });
-                }
-
-                return res.status(200).json({
-                    message: 'Password berhasil diubah. Silakan login kembali.',
-                });
-            } catch (error) {
-                console.error(error);
-                return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });
-            }
-        }
+        resetPassword: async (req, res) => {}
     };
 };

[Survived] BooleanLiteral
src/controllers/authController.js:108:17
             const { newPassword } = req.body;
             const { token } = req.query;
 
-            if (!token || !newPassword) {
+            if (token || !newPassword) {
                 return res.status(400).json({ message: 'Token dan password baru wajib diisi.' });
             }

[Survived] ConditionalExpression
src/controllers/authController.js:108:17
             const { newPassword } = req.body;
             const { token } = req.query;
 
-            if (!token || !newPassword) {
+            if (false) {
                 return res.status(400).json({ message: 'Token dan password baru wajib diisi.' });
             }

[Survived] BlockStatement
src/controllers/authController.js:112:17
                 return res.status(400).json({ message: 'Token dan password baru wajib diisi.' });
             }
 
-            try {
-                const { error } = await authService.resetPassword(token, newPassword);
-
-                if (error) {
-                    console.error(error);
-                    return res.status(400).json({ message: error.message });
-                }
-
-                return res.status(200).json({
-                    message: 'Password berhasil diubah. Silakan login kembali.',
-                });
-            } catch (error) {
+            try {} catch (error) {
                 console.error(error);
                 return res.status(500).json({ message: 'Terjadi kesalahan pada server.' });

[Survived] BlockStatement
src/controllers/authController.js:115:28
             try {
                 const { error } = await authService.resetPassword(token, newPassword);
 
-                if (error) {
-                    console.error(error);
-                    return res.status(400).json({ message: error.message });
-                }
+                if (error) {}
 
                 return res.status(200).json({

[Survived] StringLiteral
src/controllers/authController.js:121:30
                 }
 
                 return res.status(200).json({
-                    message: 'Password berhasil diubah. Silakan login kembali.',
+                    message: "",
                 });
             } catch (error) {
