[Survived] BlockStatement
src/services/authService.js:11:33
      * @description Konstruktor untuk menginjeksi dependensi repository.
      * @param {object} authRepository - Instance dari kelas yang mengimplementasikan AuthRepository.
      */
-    constructor(authRepository) {
-        if (!authRepository) {
-            throw new Error('AuthRepository harus disediakan.');
-        }
-        this.authRepository = authRepository;
-    }
+    constructor(authRepository) {}
 
     /**

[Survived] ConditionalExpression
src/services/authService.js:12:13
      * @param {object} authRepository - Instance dari kelas yang mengimplementasikan AuthRepository.
      */
     constructor(authRepository) {
-        if (!authRepository) {
+        if (true) {
             throw new Error('AuthRepository harus disediakan.');
         }

[Survived] BooleanLiteral
src/services/authService.js:12:13
      * @param {object} authRepository - Instance dari kelas yang mengimplementasikan AuthRepository.
      */
     constructor(authRepository) {
-        if (!authRepository) {
+        if (authRepository) {
             throw new Error('AuthRepository harus disediakan.');
         }

[Survived] StringLiteral
src/services/authService.js:13:29
      */
     constructor(authRepository) {
         if (!authRepository) {
-            throw new Error('AuthRepository harus disediakan.');
+            throw new Error("");
         }
         this.authRepository = authRepository;

[Survived] BlockStatement
src/services/authService.js:25:57
      * @param {object} additionalData
      * @returns {Promise<object>}
      */
-    async registerUser(email, password, additionalData) {
-        if (password.length < 8) {
-            throw new Error('Password harus memiliki minimal 8 Karakter. ');
-        }
-
-        if (!/\d/.test(password)) {
-            throw new Error('Paasword harus mengandung setidaknya satu angka. ');
-        }
-        return this.authRepository.registerUser(email, password, additionalData);
-    }
+    async registerUser(email, password, additionalData) {}
 
     /**

[Survived] ConditionalExpression
src/services/authService.js:26:13
      * @returns {Promise<object>}
      */
     async registerUser(email, password, additionalData) {
-        if (password.length < 8) {
+        if (true) {
             throw new Error('Password harus memiliki minimal 8 Karakter. ');
         }

[Survived] ConditionalExpression
src/services/authService.js:26:13
      * @returns {Promise<object>}
      */
     async registerUser(email, password, additionalData) {
-        if (password.length < 8) {
+        if (false) {
             throw new Error('Password harus memiliki minimal 8 Karakter. ');
         }

[Survived] ConditionalExpression
src/services/authService.js:30:13
             throw new Error('Password harus memiliki minimal 8 Karakter. ');
         }
 
-        if (!/\d/.test(password)) {
+        if (false) {
             throw new Error('Paasword harus mengandung setidaknya satu angka. ');
         }

[Survived] ConditionalExpression
src/services/authService.js:30:13
             throw new Error('Password harus memiliki minimal 8 Karakter. ');
         }
 
-        if (!/\d/.test(password)) {
+        if (true) {
             throw new Error('Paasword harus mengandung setidaknya satu angka. ');
         }

[Survived] BlockStatement
src/services/authService.js:42:38
      * @param {string} password
      * @returns {Promise<object>}
      */
-    async loginUser(email, password) {
-        return this.authRepository.loginUser(email, password);
-    }
+    async loginUser(email, password) {}
 
     /**

[Survived] BlockStatement
src/services/authService.js:50:24
      * @description Melakukan logout pengguna.
      * @returns {Promise<void>}
      */
-    async logoutUser() {
-        return this.authRepository.logoutUser();
-    }
+    async logoutUser() {}
 
     /**

[Survived] BlockStatement
src/services/authService.js:59:33
      * @param {string} email
      * @returns {Promise<object>}
      */
-    async forgotPassword(email) {
-        return this.authRepository.forgotPassword(email);
-    }
+    async forgotPassword(email) {}
 
     /**

[Survived] BlockStatement
src/services/authService.js:69:45
      * @param {string} newPassword
      * @returns {Promise<object>}
      */
-    async resetPassword(token, newPassword) {
-        return this.authRepository.resetPassword(token, newPassword);
-    }
+    async resetPassword(token, newPassword) {}
 }
