[Survived] BlockStatement
src/services/userService.js:4:33
 
 
 export class UserService {
-    constructor(userRepository) {
-        if (!userRepository) {
-            throw new Error('UserRepository harus disediakan.');
-        }
-        this.userRepository = userRepository;
-    }
+    constructor(userRepository) {}
 
     async getMyProfile(userId) {

[Survived] BlockStatement
src/services/userService.js:5:30
 
 export class UserService {
     constructor(userRepository) {
-        if (!userRepository) {
-            throw new Error('UserRepository harus disediakan.');
-        }
+        if (!userRepository) {}
         this.userRepository = userRepository;
     }

[Survived] ConditionalExpression
src/services/userService.js:5:13
 
 export class UserService {
     constructor(userRepository) {
-        if (!userRepository) {
+        if (true) {
             throw new Error('UserRepository harus disediakan.');
         }

[Survived] BlockStatement
src/services/userService.js:11:32
         this.userRepository = userRepository;
     }
 
-    async getMyProfile(userId) {
-        return this.userRepository.findById(userId);
-    }
+    async getMyProfile(userId) {}
 
     async getAllUsers() {

[Survived] BlockStatement
src/services/userService.js:15:25
         return this.userRepository.findById(userId);
     }
 
-    async getAllUsers() {
-        return this.userRepository.findAll();
-    }
+    async getAllUsers() {}
 
     async createUser(userData) {

[Survived] BlockStatement
src/services/userService.js:19:32
         return this.userRepository.findAll();
     }
 
-    async createUser(userData) {
-
-        return this.userRepository.createUser(userData);
-    }
+    async createUser(userData) {}
 }
